GopalSaraf/Practicals/PSDL/include/proc/pic18f47q43.h
extern volatile IPR6bits_t IPR6bits __at(0x368);
// bitfield macros
#define _IPR6_INT1IP_POSN                                   0x0
#define _IPR6_INT1IP_POSITION                               0x0
#define _IPR6_INT1IP_SIZE                                   0x1
#define _IPR6_INT1IP_LENGTH                                 0x1
#define _IPR6_INT1IP_MASK                                   0x1
#define _IPR6_CLC2IP_POSN                                   0x1
#define _IPR6_CLC2IP_POSITION                               0x1
#define _IPR6_CLC2IP_SIZE                                   0x1
#define _IPR6_CLC2IP_LENGTH                                 0x1
#define _IPR6_CLC2IP_MASK                                   0x2
#define _IPR6_CWG1IP_POSN                                   0x2
#define _IPR6_CWG1IP_POSITION                               0x2
#define _IPR6_CWG1IP_SIZE                                   0x1
#define _IPR6_CWG1IP_LENGTH                                 0x1
#define _IPR6_CWG1IP_MASK                                   0x4
#define _IPR6_NCO1IP_POSN                                   0x3
#define _IPR6_NCO1IP_POSITION                               0x3
#define _IPR6_NCO1IP_SIZE                                   0x1
#define _IPR6_NCO1IP_LENGTH                                 0x1
#define _IPR6_NCO1IP_MASK                                   0x8
#define _IPR6_DMA2SCNTIP_POSN                               0x4
#define _IPR6_DMA2SCNTIP_POSITION                           0x4
#define _IPR6_DMA2SCNTIP_SIZE                               0x1
#define _IPR6_DMA2SCNTIP_LENGTH                             0x1
#define _IPR6_DMA2SCNTIP_MASK                               0x10
#define _IPR6_DMA2DCNTIP_POSN                               0x5
#define _IPR6_DMA2DCNTIP_POSITION                           0x5
#define _IPR6_DMA2DCNTIP_SIZE                               0x1
#define _IPR6_DMA2DCNTIP_LENGTH                             0x1
#define _IPR6_DMA2DCNTIP_MASK                               0x20
#define _IPR6_DMA2ORIP_POSN                                 0x6
#define _IPR6_DMA2ORIP_POSITION                             0x6
#define _IPR6_DMA2ORIP_SIZE                                 0x1
#define _IPR6_DMA2ORIP_LENGTH                               0x1
#define _IPR6_DMA2ORIP_MASK                                 0x40
#define _IPR6_DMA2AIP_POSN                                  0x7
#define _IPR6_DMA2AIP_POSITION                              0x7
#define _IPR6_DMA2AIP_SIZE                                  0x1
#define _IPR6_DMA2AIP_LENGTH                                0x1
#define _IPR6_DMA2AIP_MASK                                  0x80

// Register: IPR7
#define IPR7 IPR7
extern volatile unsigned char           IPR7                __at(0x369);
#ifndef _LIB_BUILD
asm("IPR7 equ 0369h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1RXIP               :1;
        unsigned I2C1TXIP               :1;
        unsigned I2C1IP                 :1;
        unsigned I2C1EIP                :1;
        unsigned                        :1;
        unsigned CLC3IP                 :1;
        unsigned PWM3PIP                :1;
        unsigned PWM3IP                 :1;
    };
} IPR7bits_t;
extern volatile IPR7bits_t IPR7bits __at(0x369);
// bitfield macros
#define _IPR7_I2C1RXIP_POSN                                 0x0
#define _IPR7_I2C1RXIP_POSITION                             0x0
#define _IPR7_I2C1RXIP_SIZE                                 0x1
#define _IPR7_I2C1RXIP_LENGTH                               0x1
#define _IPR7_I2C1RXIP_MASK                                 0x1
#define _IPR7_I2C1TXIP_POSN                                 0x1
#define _IPR7_I2C1TXIP_POSITION                             0x1
#define _IPR7_I2C1TXIP_SIZE                                 0x1
#define _IPR7_I2C1TXIP_LENGTH                               0x1
#define _IPR7_I2C1TXIP_MASK                                 0x2
#define _IPR7_I2C1IP_POSN                                   0x2
#define _IPR7_I2C1IP_POSITION                               0x2
#define _IPR7_I2C1IP_SIZE                                   0x1
#define _IPR7_I2C1IP_LENGTH                                 0x1
#define _IPR7_I2C1IP_MASK                                   0x4
#define _IPR7_I2C1EIP_POSN                                  0x3
#define _IPR7_I2C1EIP_POSITION                              0x3
#define _IPR7_I2C1EIP_SIZE                                  0x1
#define _IPR7_I2C1EIP_LENGTH                                0x1
#define _IPR7_I2C1EIP_MASK                                  0x8
#define _IPR7_CLC3IP_POSN                                   0x5
#define _IPR7_CLC3IP_POSITION                               0x5
#define _IPR7_CLC3IP_SIZE                                   0x1
#define _IPR7_CLC3IP_LENGTH                                 0x1
#define _IPR7_CLC3IP_MASK                                   0x20
#define _IPR7_PWM3PIP_POSN                                  0x6
#define _IPR7_PWM3PIP_POSITION                              0x6
#define _IPR7_PWM3PIP_SIZE                                  0x1
#define _IPR7_PWM3PIP_LENGTH                                0x1
#define _IPR7_PWM3PIP_MASK                                  0x40
#define _IPR7_PWM3IP_POSN                                   0x7
#define _IPR7_PWM3IP_POSITION                               0x7
#define _IPR7_PWM3IP_SIZE                                   0x1
#define _IPR7_PWM3IP_LENGTH                                 0x1
#define _IPR7_PWM3IP_MASK                                   0x80

// Register: IPR8
#define IPR8 IPR8
extern volatile unsigned char           IPR8                __at(0x36A);
#ifndef _LIB_BUILD
asm("IPR8 equ 036Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U2RXIP                 :1;
        unsigned U2TXIP                 :1;
        unsigned U2EIP                  :1;
        unsigned U2IP                   :1;
        unsigned TMR5IP                 :1;
        unsigned TMR5GIP                :1;
        unsigned CCP2IP                 :1;
        unsigned SCANIP                 :1;
    };
} IPR8bits_t;
extern volatile IPR8bits_t IPR8bits __at(0x36A);
// bitfield macros
#define _IPR8_U2RXIP_POSN                                   0x0
#define _IPR8_U2RXIP_POSITION                               0x0
#define _IPR8_U2RXIP_SIZE                                   0x1
#define _IPR8_U2RXIP_LENGTH                                 0x1
#define _IPR8_U2RXIP_MASK                                   0x1
#define _IPR8_U2TXIP_POSN                                   0x1
#define _IPR8_U2TXIP_POSITION                               0x1
#define _IPR8_U2TXIP_SIZE                                   0x1
#define _IPR8_U2TXIP_LENGTH                                 0x1
#define _IPR8_U2TXIP_MASK                                   0x2
#define _IPR8_U2EIP_POSN                                    0x2
#define _IPR8_U2EIP_POSITION                                0x2
#define _IPR8_U2EIP_SIZE                                    0x1
#define _IPR8_U2EIP_LENGTH                                  0x1
#define _IPR8_U2EIP_MASK                                    0x4
#define _IPR8_U2IP_POSN                                     0x3
#define _IPR8_U2IP_POSITION                                 0x3
#define _IPR8_U2IP_SIZE                                     0x1
#define _IPR8_U2IP_LENGTH                                   0x1
#define _IPR8_U2IP_MASK                                     0x8
#define _IPR8_TMR5IP_POSN                                   0x4
#define _IPR8_TMR5IP_POSITION                               0x4
#define _IPR8_TMR5IP_SIZE                                   0x1
#define _IPR8_TMR5IP_LENGTH                                 0x1
#define _IPR8_TMR5IP_MASK                                   0x10
#define _IPR8_TMR5GIP_POSN                                  0x5
#define _IPR8_TMR5GIP_POSITION                              0x5
#define _IPR8_TMR5GIP_SIZE                                  0x1
#define _IPR8_TMR5GIP_LENGTH                                0x1
#define _IPR8_TMR5GIP_MASK                                  0x20
#define _IPR8_CCP2IP_POSN                                   0x6
#define _IPR8_CCP2IP_POSITION                               0x6
#define _IPR8_CCP2IP_SIZE                                   0x1
#define _IPR8_CCP2IP_LENGTH                                 0x1
#define _IPR8_CCP2IP_MASK                                   0x40
#define _IPR8_SCANIP_POSN                                   0x7
#define _IPR8_SCANIP_POSITION                               0x7
#define _IPR8_SCANIP_SIZE                                   0x1
#define _IPR8_SCANIP_LENGTH                                 0x1
#define _IPR8_SCANIP_MASK                                   0x80

// Register: IPR9
#define IPR9 IPR9
extern volatile unsigned char           IPR9                __at(0x36B);
#ifndef _LIB_BUILD
asm("IPR9 equ 036Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U3RXIP                 :1;
        unsigned U3TXIP                 :1;
        unsigned U3EIP                  :1;
        unsigned U3IP                   :1;
        unsigned                        :1;
        unsigned CLC4IP                 :1;
    };
} IPR9bits_t;
extern volatile IPR9bits_t IPR9bits __at(0x36B);
// bitfield macros
#define _IPR9_U3RXIP_POSN                                   0x0
#define _IPR9_U3RXIP_POSITION                               0x0
#define _IPR9_U3RXIP_SIZE                                   0x1
#define _IPR9_U3RXIP_LENGTH                                 0x1
#define _IPR9_U3RXIP_MASK                                   0x1
#define _IPR9_U3TXIP_POSN                                   0x1
#define _IPR9_U3TXIP_POSITION                               0x1
#define _IPR9_U3TXIP_SIZE                                   0x1
#define _IPR9_U3TXIP_LENGTH                                 0x1
#define _IPR9_U3TXIP_MASK                                   0x2
#define _IPR9_U3EIP_POSN                                    0x2
#define _IPR9_U3EIP_POSITION                                0x2
#define _IPR9_U3EIP_SIZE                                    0x1
#define _IPR9_U3EIP_LENGTH                                  0x1
#define _IPR9_U3EIP_MASK                                    0x4
#define _IPR9_U3IP_POSN                                     0x3
#define _IPR9_U3IP_POSITION                                 0x3
#define _IPR9_U3IP_SIZE                                     0x1
#define _IPR9_U3IP_LENGTH                                   0x1
#define _IPR9_U3IP_MASK                                     0x8
#define _IPR9_CLC4IP_POSN                                   0x5
#define _IPR9_CLC4IP_POSITION                               0x5
#define _IPR9_CLC4IP_SIZE                                   0x1
#define _IPR9_CLC4IP_LENGTH                                 0x1
#define _IPR9_CLC4IP_MASK                                   0x20

// Register: IPR10
#define IPR10 IPR10
extern volatile unsigned char           IPR10               __at(0x36C);
#ifndef _LIB_BUILD
asm("IPR10 equ 036Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT2IP                 :1;
        unsigned CLC5IP                 :1;
        unsigned CWG2IP                 :1;
        unsigned NCO2IP                 :1;
        unsigned DMA3SCNTIP             :1;
        unsigned DMA3DCNTIP             :1;
        unsigned DMA3ORIP               :1;
        unsigned DMA3AIP                :1;
    };
} IPR10bits_t;
