GopalSaraf/Practicals/PSDL/include/proc/pic18f47q43.h
extern volatile WREG_CSHADbits_t WREG_CSHADbits __at(0x374);
// bitfield macros
#define _WREG_CSHAD_WREG_POSN                               0x0
#define _WREG_CSHAD_WREG_POSITION                           0x0
#define _WREG_CSHAD_WREG_SIZE                               0x8
#define _WREG_CSHAD_WREG_LENGTH                             0x8
#define _WREG_CSHAD_WREG_MASK                               0xFF

// Register: BSR_CSHAD
#define BSR_CSHAD BSR_CSHAD
extern volatile unsigned char           BSR_CSHAD           __at(0x375);
#ifndef _LIB_BUILD
asm("BSR_CSHAD equ 0375h");
#endif

// Register: SHADCON
#define SHADCON SHADCON
extern volatile unsigned char           SHADCON             __at(0x376);
#ifndef _LIB_BUILD
asm("SHADCON equ 0376h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SHADLO                 :1;
    };
} SHADCONbits_t;
extern volatile SHADCONbits_t SHADCONbits __at(0x376);
// bitfield macros
#define _SHADCON_SHADLO_POSN                                0x0
#define _SHADCON_SHADLO_POSITION                            0x0
#define _SHADCON_SHADLO_SIZE                                0x1
#define _SHADCON_SHADLO_LENGTH                              0x1
#define _SHADCON_SHADLO_MASK                                0x1

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
extern volatile unsigned char           STATUS_SHAD         __at(0x377);
#ifndef _LIB_BUILD
asm("STATUS_SHAD equ 0377h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned NOT_PD                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned NOT_TO                 :1;
    };
    struct {
        unsigned C                      :1;
        unsigned DC                     :1;
        unsigned Z                      :1;
        unsigned OV                     :1;
        unsigned N                      :1;
        unsigned nPD                    :1;
        unsigned nTO                    :1;
    };
    struct {
        unsigned                        :5;
        unsigned PD                     :1;
        unsigned TO                     :1;
    };
} STATUS_SHADbits_t;
extern volatile STATUS_SHADbits_t STATUS_SHADbits __at(0x377);
// bitfield macros
#define _STATUS_SHAD_NOT_PD_POSN                            0x5
#define _STATUS_SHAD_NOT_PD_POSITION                        0x5
#define _STATUS_SHAD_NOT_PD_SIZE                            0x1
#define _STATUS_SHAD_NOT_PD_LENGTH                          0x1
#define _STATUS_SHAD_NOT_PD_MASK                            0x20
#define _STATUS_SHAD_NOT_TO_POSN                            0x6
#define _STATUS_SHAD_NOT_TO_POSITION                        0x6
#define _STATUS_SHAD_NOT_TO_SIZE                            0x1
#define _STATUS_SHAD_NOT_TO_LENGTH                          0x1
#define _STATUS_SHAD_NOT_TO_MASK                            0x40
#define _STATUS_SHAD_C_POSN                                 0x0
#define _STATUS_SHAD_C_POSITION                             0x0
#define _STATUS_SHAD_C_SIZE                                 0x1
#define _STATUS_SHAD_C_LENGTH                               0x1
#define _STATUS_SHAD_C_MASK                                 0x1
#define _STATUS_SHAD_DC_POSN                                0x1
#define _STATUS_SHAD_DC_POSITION                            0x1
#define _STATUS_SHAD_DC_SIZE                                0x1
#define _STATUS_SHAD_DC_LENGTH                              0x1
#define _STATUS_SHAD_DC_MASK                                0x2
#define _STATUS_SHAD_Z_POSN                                 0x2
#define _STATUS_SHAD_Z_POSITION                             0x2
#define _STATUS_SHAD_Z_SIZE                                 0x1
#define _STATUS_SHAD_Z_LENGTH                               0x1
#define _STATUS_SHAD_Z_MASK                                 0x4
#define _STATUS_SHAD_OV_POSN                                0x3
#define _STATUS_SHAD_OV_POSITION                            0x3
#define _STATUS_SHAD_OV_SIZE                                0x1
#define _STATUS_SHAD_OV_LENGTH                              0x1
#define _STATUS_SHAD_OV_MASK                                0x8
#define _STATUS_SHAD_N_POSN                                 0x4
#define _STATUS_SHAD_N_POSITION                             0x4
#define _STATUS_SHAD_N_SIZE                                 0x1
#define _STATUS_SHAD_N_LENGTH                               0x1
#define _STATUS_SHAD_N_MASK                                 0x10
#define _STATUS_SHAD_nPD_POSN                               0x5
#define _STATUS_SHAD_nPD_POSITION                           0x5
#define _STATUS_SHAD_nPD_SIZE                               0x1
#define _STATUS_SHAD_nPD_LENGTH                             0x1
#define _STATUS_SHAD_nPD_MASK                               0x20
#define _STATUS_SHAD_nTO_POSN                               0x6
#define _STATUS_SHAD_nTO_POSITION                           0x6
#define _STATUS_SHAD_nTO_SIZE                               0x1
#define _STATUS_SHAD_nTO_LENGTH                             0x1
#define _STATUS_SHAD_nTO_MASK                               0x40
#define _STATUS_SHAD_PD_POSN                                0x5
#define _STATUS_SHAD_PD_POSITION                            0x5
#define _STATUS_SHAD_PD_SIZE                                0x1
#define _STATUS_SHAD_PD_LENGTH                              0x1
#define _STATUS_SHAD_PD_MASK                                0x20
#define _STATUS_SHAD_TO_POSN                                0x6
#define _STATUS_SHAD_TO_POSITION                            0x6
#define _STATUS_SHAD_TO_SIZE                                0x1
#define _STATUS_SHAD_TO_LENGTH                              0x1
#define _STATUS_SHAD_TO_MASK                                0x40

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
extern volatile unsigned char           WREG_SHAD           __at(0x378);
#ifndef _LIB_BUILD
asm("WREG_SHAD equ 0378h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG                   :8;
    };
} WREG_SHADbits_t;
extern volatile WREG_SHADbits_t WREG_SHADbits __at(0x378);
// bitfield macros
#define _WREG_SHAD_WREG_POSN                                0x0
#define _WREG_SHAD_WREG_POSITION                            0x0
#define _WREG_SHAD_WREG_SIZE                                0x8
#define _WREG_SHAD_WREG_LENGTH                              0x8
#define _WREG_SHAD_WREG_MASK                                0xFF

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
extern volatile unsigned char           BSR_SHAD            __at(0x379);
#ifndef _LIB_BUILD
asm("BSR_SHAD equ 0379h");
#endif

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
extern volatile unsigned char           PCLATH_SHAD         __at(0x37A);
#ifndef _LIB_BUILD
asm("PCLATH_SHAD equ 037Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :8;
    };
} PCLATH_SHADbits_t;
extern volatile PCLATH_SHADbits_t PCLATH_SHADbits __at(0x37A);
// bitfield macros
#define _PCLATH_SHAD_PCH_POSN                               0x0
#define _PCLATH_SHAD_PCH_POSITION                           0x0
#define _PCLATH_SHAD_PCH_SIZE                               0x8
#define _PCLATH_SHAD_PCH_LENGTH                             0x8
#define _PCLATH_SHAD_PCH_MASK                               0xFF

