GopalSaraf/Practicals/PSDL/include/proc/pic18f47q43.h
// Register: NCO3INCU
#define NCO3INCU NCO3INCU
extern volatile unsigned char           NCO3INCU            __at(0x455);
#ifndef _LIB_BUILD
asm("NCO3INCU equ 0455h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INC                    :4;
    };
    struct {
        unsigned NCO3INC16              :1;
        unsigned NCO3INC17              :1;
        unsigned NCO3INC18              :1;
        unsigned NCO3INC19              :1;
    };
    struct {
        unsigned INC16                  :1;
        unsigned INC17                  :1;
        unsigned INC18                  :1;
        unsigned INC19                  :1;
    };
    struct {
        unsigned NCO3INC                :4;
    };
} NCO3INCUbits_t;
extern volatile NCO3INCUbits_t NCO3INCUbits __at(0x455);
// bitfield macros
#define _NCO3INCU_INC_POSN                                  0x0
#define _NCO3INCU_INC_POSITION                              0x0
#define _NCO3INCU_INC_SIZE                                  0x4
#define _NCO3INCU_INC_LENGTH                                0x4
#define _NCO3INCU_INC_MASK                                  0xF
#define _NCO3INCU_NCO3INC16_POSN                            0x0
#define _NCO3INCU_NCO3INC16_POSITION                        0x0
#define _NCO3INCU_NCO3INC16_SIZE                            0x1
#define _NCO3INCU_NCO3INC16_LENGTH                          0x1
#define _NCO3INCU_NCO3INC16_MASK                            0x1
#define _NCO3INCU_NCO3INC17_POSN                            0x1
#define _NCO3INCU_NCO3INC17_POSITION                        0x1
#define _NCO3INCU_NCO3INC17_SIZE                            0x1
#define _NCO3INCU_NCO3INC17_LENGTH                          0x1
#define _NCO3INCU_NCO3INC17_MASK                            0x2
#define _NCO3INCU_NCO3INC18_POSN                            0x2
#define _NCO3INCU_NCO3INC18_POSITION                        0x2
#define _NCO3INCU_NCO3INC18_SIZE                            0x1
#define _NCO3INCU_NCO3INC18_LENGTH                          0x1
#define _NCO3INCU_NCO3INC18_MASK                            0x4
#define _NCO3INCU_NCO3INC19_POSN                            0x3
#define _NCO3INCU_NCO3INC19_POSITION                        0x3
#define _NCO3INCU_NCO3INC19_SIZE                            0x1
#define _NCO3INCU_NCO3INC19_LENGTH                          0x1
#define _NCO3INCU_NCO3INC19_MASK                            0x8
#define _NCO3INCU_INC16_POSN                                0x0
#define _NCO3INCU_INC16_POSITION                            0x0
#define _NCO3INCU_INC16_SIZE                                0x1
#define _NCO3INCU_INC16_LENGTH                              0x1
#define _NCO3INCU_INC16_MASK                                0x1
#define _NCO3INCU_INC17_POSN                                0x1
#define _NCO3INCU_INC17_POSITION                            0x1
#define _NCO3INCU_INC17_SIZE                                0x1
#define _NCO3INCU_INC17_LENGTH                              0x1
#define _NCO3INCU_INC17_MASK                                0x2
#define _NCO3INCU_INC18_POSN                                0x2
#define _NCO3INCU_INC18_POSITION                            0x2
#define _NCO3INCU_INC18_SIZE                                0x1
#define _NCO3INCU_INC18_LENGTH                              0x1
#define _NCO3INCU_INC18_MASK                                0x4
#define _NCO3INCU_INC19_POSN                                0x3
#define _NCO3INCU_INC19_POSITION                            0x3
#define _NCO3INCU_INC19_SIZE                                0x1
#define _NCO3INCU_INC19_LENGTH                              0x1
#define _NCO3INCU_INC19_MASK                                0x8
#define _NCO3INCU_NCO3INC_POSN                              0x0
#define _NCO3INCU_NCO3INC_POSITION                          0x0
#define _NCO3INCU_NCO3INC_SIZE                              0x4
#define _NCO3INCU_NCO3INC_LENGTH                            0x4
#define _NCO3INCU_NCO3INC_MASK                              0xF

// Register: NCO3CON
#define NCO3CON NCO3CON
extern volatile unsigned char           NCO3CON             __at(0x456);
#ifndef _LIB_BUILD
asm("NCO3CON equ 0456h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PFM                    :1;
        unsigned                        :3;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned NCO3PFM                :1;
        unsigned                        :3;
        unsigned NCO3POL                :1;
        unsigned NCO3OUT                :1;
        unsigned                        :1;
        unsigned NCO3EN                 :1;
    };
} NCO3CONbits_t;
extern volatile NCO3CONbits_t NCO3CONbits __at(0x456);
// bitfield macros
#define _NCO3CON_PFM_POSN                                   0x0
#define _NCO3CON_PFM_POSITION                               0x0
#define _NCO3CON_PFM_SIZE                                   0x1
#define _NCO3CON_PFM_LENGTH                                 0x1
#define _NCO3CON_PFM_MASK                                   0x1
#define _NCO3CON_POL_POSN                                   0x4
#define _NCO3CON_POL_POSITION                               0x4
#define _NCO3CON_POL_SIZE                                   0x1
#define _NCO3CON_POL_LENGTH                                 0x1
#define _NCO3CON_POL_MASK                                   0x10
#define _NCO3CON_OUT_POSN                                   0x5
#define _NCO3CON_OUT_POSITION                               0x5
#define _NCO3CON_OUT_SIZE                                   0x1
#define _NCO3CON_OUT_LENGTH                                 0x1
#define _NCO3CON_OUT_MASK                                   0x20
#define _NCO3CON_EN_POSN                                    0x7
#define _NCO3CON_EN_POSITION                                0x7
#define _NCO3CON_EN_SIZE                                    0x1
#define _NCO3CON_EN_LENGTH                                  0x1
#define _NCO3CON_EN_MASK                                    0x80
#define _NCO3CON_NCO3PFM_POSN                               0x0
#define _NCO3CON_NCO3PFM_POSITION                           0x0
#define _NCO3CON_NCO3PFM_SIZE                               0x1
#define _NCO3CON_NCO3PFM_LENGTH                             0x1
#define _NCO3CON_NCO3PFM_MASK                               0x1
#define _NCO3CON_NCO3POL_POSN                               0x4
#define _NCO3CON_NCO3POL_POSITION                           0x4
#define _NCO3CON_NCO3POL_SIZE                               0x1
#define _NCO3CON_NCO3POL_LENGTH                             0x1
#define _NCO3CON_NCO3POL_MASK                               0x10
#define _NCO3CON_NCO3OUT_POSN                               0x5
#define _NCO3CON_NCO3OUT_POSITION                           0x5
#define _NCO3CON_NCO3OUT_SIZE                               0x1
#define _NCO3CON_NCO3OUT_LENGTH                             0x1
#define _NCO3CON_NCO3OUT_MASK                               0x20
#define _NCO3CON_NCO3EN_POSN                                0x7
#define _NCO3CON_NCO3EN_POSITION                            0x7
#define _NCO3CON_NCO3EN_SIZE                                0x1
#define _NCO3CON_NCO3EN_LENGTH                              0x1
#define _NCO3CON_NCO3EN_MASK                                0x80

// Register: NCO3CLK
#define NCO3CLK NCO3CLK
extern volatile unsigned char           NCO3CLK             __at(0x457);
#ifndef _LIB_BUILD
asm("NCO3CLK equ 0457h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CKS                    :5;
        unsigned PWS                    :3;
    };
    struct {
        unsigned CKS0                   :1;
        unsigned CKS1                   :1;
        unsigned CKS2                   :1;
        unsigned CKS3                   :1;
        unsigned CKS4                   :1;
        unsigned PWS0                   :1;
        unsigned PWS1                   :1;
        unsigned PWS2                   :1;
    };
    struct {
        unsigned NCO3CKS                :5;
        unsigned NCO3PWS                :3;
    };
    struct {
        unsigned NCO3CKS0               :1;
        unsigned NCO3CKS1               :1;
        unsigned NCO3CKS2               :1;
        unsigned NCO3CKS3               :1;
        unsigned NCO3CKS4               :1;
        unsigned NCO3PWS0               :1;
        unsigned NCO3PWS1               :1;
        unsigned NCO3PWS2               :1;
    };
} NCO3CLKbits_t;
extern volatile NCO3CLKbits_t NCO3CLKbits __at(0x457);
// bitfield macros
#define _NCO3CLK_CKS_POSN                                   0x0
#define _NCO3CLK_CKS_POSITION                               0x0
#define _NCO3CLK_CKS_SIZE                                   0x5
#define _NCO3CLK_CKS_LENGTH                                 0x5
#define _NCO3CLK_CKS_MASK                                   0x1F
#define _NCO3CLK_PWS_POSN                                   0x5
#define _NCO3CLK_PWS_POSITION                               0x5
#define _NCO3CLK_PWS_SIZE                                   0x3
#define _NCO3CLK_PWS_LENGTH                                 0x3
#define _NCO3CLK_PWS_MASK                                   0xE0
#define _NCO3CLK_CKS0_POSN                                  0x0
#define _NCO3CLK_CKS0_POSITION                              0x0
#define _NCO3CLK_CKS0_SIZE                                  0x1
#define _NCO3CLK_CKS0_LENGTH                                0x1
#define _NCO3CLK_CKS0_MASK                                  0x1
#define _NCO3CLK_CKS1_POSN                                  0x1
#define _NCO3CLK_CKS1_POSITION                              0x1
#define _NCO3CLK_CKS1_SIZE                                  0x1
#define _NCO3CLK_CKS1_LENGTH                                0x1
#define _NCO3CLK_CKS1_MASK                                  0x2
#define _NCO3CLK_CKS2_POSN                                  0x2
#define _NCO3CLK_CKS2_POSITION                              0x2
#define _NCO3CLK_CKS2_SIZE                                  0x1
#define _NCO3CLK_CKS2_LENGTH                                0x1
#define _NCO3CLK_CKS2_MASK                                  0x4
#define _NCO3CLK_CKS3_POSN                                  0x3
#define _NCO3CLK_CKS3_POSITION                              0x3
#define _NCO3CLK_CKS3_SIZE                                  0x1
#define _NCO3CLK_CKS3_LENGTH                                0x1
#define _NCO3CLK_CKS3_MASK                                  0x8
#define _NCO3CLK_CKS4_POSN                                  0x4
#define _NCO3CLK_CKS4_POSITION                              0x4
#define _NCO3CLK_CKS4_SIZE                                  0x1
#define _NCO3CLK_CKS4_LENGTH                                0x1
#define _NCO3CLK_CKS4_MASK                                  0x10
#define _NCO3CLK_PWS0_POSN                                  0x5
#define _NCO3CLK_PWS0_POSITION                              0x5
#define _NCO3CLK_PWS0_SIZE                                  0x1
#define _NCO3CLK_PWS0_LENGTH                                0x1
#define _NCO3CLK_PWS0_MASK                                  0x20
#define _NCO3CLK_PWS1_POSN                                  0x6
#define _NCO3CLK_PWS1_POSITION                              0x6
#define _NCO3CLK_PWS1_SIZE                                  0x1
#define _NCO3CLK_PWS1_LENGTH                                0x1
#define _NCO3CLK_PWS1_MASK                                  0x40
#define _NCO3CLK_PWS2_POSN                                  0x7
#define _NCO3CLK_PWS2_POSITION                              0x7
#define _NCO3CLK_PWS2_SIZE                                  0x1
#define _NCO3CLK_PWS2_LENGTH                                0x1
#define _NCO3CLK_PWS2_MASK                                  0x80
#define _NCO3CLK_NCO3CKS_POSN                               0x0
#define _NCO3CLK_NCO3CKS_POSITION                           0x0
#define _NCO3CLK_NCO3CKS_SIZE                               0x5
#define _NCO3CLK_NCO3CKS_LENGTH                             0x5
#define _NCO3CLK_NCO3CKS_MASK                               0x1F
#define _NCO3CLK_NCO3PWS_POSN                               0x5
#define _NCO3CLK_NCO3PWS_POSITION                           0x5
#define _NCO3CLK_NCO3PWS_SIZE                               0x3
#define _NCO3CLK_NCO3PWS_LENGTH                             0x3
#define _NCO3CLK_NCO3PWS_MASK                               0xE0
#define _NCO3CLK_NCO3CKS0_POSN                              0x0
#define _NCO3CLK_NCO3CKS0_POSITION                          0x0
#define _NCO3CLK_NCO3CKS0_SIZE                              0x1
#define _NCO3CLK_NCO3CKS0_LENGTH                            0x1
#define _NCO3CLK_NCO3CKS0_MASK                              0x1
#define _NCO3CLK_NCO3CKS1_POSN                              0x1
#define _NCO3CLK_NCO3CKS1_POSITION                          0x1
#define _NCO3CLK_NCO3CKS1_SIZE                              0x1
#define _NCO3CLK_NCO3CKS1_LENGTH                            0x1
#define _NCO3CLK_NCO3CKS1_MASK                              0x2
#define _NCO3CLK_NCO3CKS2_POSN                              0x2
#define _NCO3CLK_NCO3CKS2_POSITION                          0x2
#define _NCO3CLK_NCO3CKS2_SIZE                              0x1
#define _NCO3CLK_NCO3CKS2_LENGTH                            0x1
#define _NCO3CLK_NCO3CKS2_MASK                              0x4
#define _NCO3CLK_NCO3CKS3_POSN                              0x3
#define _NCO3CLK_NCO3CKS3_POSITION                          0x3
#define _NCO3CLK_NCO3CKS3_SIZE                              0x1
#define _NCO3CLK_NCO3CKS3_LENGTH                            0x1
#define _NCO3CLK_NCO3CKS3_MASK                              0x8
#define _NCO3CLK_NCO3CKS4_POSN                              0x4
#define _NCO3CLK_NCO3CKS4_POSITION                          0x4
#define _NCO3CLK_NCO3CKS4_SIZE                              0x1
#define _NCO3CLK_NCO3CKS4_LENGTH                            0x1
#define _NCO3CLK_NCO3CKS4_MASK                              0x10
#define _NCO3CLK_NCO3PWS0_POSN                              0x5
#define _NCO3CLK_NCO3PWS0_POSITION                          0x5
#define _NCO3CLK_NCO3PWS0_SIZE                              0x1
#define _NCO3CLK_NCO3PWS0_LENGTH                            0x1
#define _NCO3CLK_NCO3PWS0_MASK                              0x20
#define _NCO3CLK_NCO3PWS1_POSN                              0x6
#define _NCO3CLK_NCO3PWS1_POSITION                          0x6
#define _NCO3CLK_NCO3PWS1_SIZE                              0x1
#define _NCO3CLK_NCO3PWS1_LENGTH                            0x1
#define _NCO3CLK_NCO3PWS1_MASK                              0x40
#define _NCO3CLK_NCO3PWS2_POSN                              0x7
#define _NCO3CLK_NCO3PWS2_POSITION                          0x7
#define _NCO3CLK_NCO3PWS2_SIZE                              0x1
#define _NCO3CLK_NCO3PWS2_LENGTH                            0x1
#define _NCO3CLK_NCO3PWS2_MASK                              0x80

// Register: IVTLOCK
#define IVTLOCK IVTLOCK
extern volatile unsigned char           IVTLOCK             __at(0x459);
#ifndef _LIB_BUILD
asm("IVTLOCK equ 0459h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IVTLOCKED              :1;
    };
} IVTLOCKbits_t;
extern volatile IVTLOCKbits_t IVTLOCKbits __at(0x459);
// bitfield macros
#define _IVTLOCK_IVTLOCKED_POSN                             0x0
#define _IVTLOCK_IVTLOCKED_POSITION                         0x0
#define _IVTLOCK_IVTLOCKED_SIZE                             0x1
#define _IVTLOCK_IVTLOCKED_LENGTH                           0x1
#define _IVTLOCK_IVTLOCKED_MASK                             0x1

