GopalSaraf/Practicals/PSDL/include/proc/pic18f47q43.h
// Register: PWM2PRH
#define PWM2PRH PWM2PRH
extern volatile unsigned char           PWM2PRH             __at(0x473);
#ifndef _LIB_BUILD
asm("PWM2PRH equ 0473h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRH                    :8;
    };
} PWM2PRHbits_t;
extern volatile PWM2PRHbits_t PWM2PRHbits __at(0x473);
// bitfield macros
#define _PWM2PRH_PRH_POSN                                   0x0
#define _PWM2PRH_PRH_POSITION                               0x0
#define _PWM2PRH_PRH_SIZE                                   0x8
#define _PWM2PRH_PRH_LENGTH                                 0x8
#define _PWM2PRH_PRH_MASK                                   0xFF

// Register: PWM2CPRE
#define PWM2CPRE PWM2CPRE
extern volatile unsigned char           PWM2CPRE            __at(0x474);
#ifndef _LIB_BUILD
asm("PWM2CPRE equ 0474h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPRE                   :8;
    };
} PWM2CPREbits_t;
extern volatile PWM2CPREbits_t PWM2CPREbits __at(0x474);
// bitfield macros
#define _PWM2CPRE_CPRE_POSN                                 0x0
#define _PWM2CPRE_CPRE_POSITION                             0x0
#define _PWM2CPRE_CPRE_SIZE                                 0x8
#define _PWM2CPRE_CPRE_LENGTH                               0x8
#define _PWM2CPRE_CPRE_MASK                                 0xFF

// Register: PWM2PIPOS
#define PWM2PIPOS PWM2PIPOS
extern volatile unsigned char           PWM2PIPOS           __at(0x475);
#ifndef _LIB_BUILD
asm("PWM2PIPOS equ 0475h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIPOS                  :8;
    };
} PWM2PIPOSbits_t;
extern volatile PWM2PIPOSbits_t PWM2PIPOSbits __at(0x475);
// bitfield macros
#define _PWM2PIPOS_PIPOS_POSN                               0x0
#define _PWM2PIPOS_PIPOS_POSITION                           0x0
#define _PWM2PIPOS_PIPOS_SIZE                               0x8
#define _PWM2PIPOS_PIPOS_LENGTH                             0x8
#define _PWM2PIPOS_PIPOS_MASK                               0xFF

// Register: PWM2GIR
#define PWM2GIR PWM2GIR
extern volatile unsigned char           PWM2GIR             __at(0x476);
#ifndef _LIB_BUILD
asm("PWM2GIR equ 0476h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1IF                 :1;
        unsigned S1P2IF                 :1;
    };
} PWM2GIRbits_t;
extern volatile PWM2GIRbits_t PWM2GIRbits __at(0x476);
// bitfield macros
#define _PWM2GIR_S1P1IF_POSN                                0x0
#define _PWM2GIR_S1P1IF_POSITION                            0x0
#define _PWM2GIR_S1P1IF_SIZE                                0x1
#define _PWM2GIR_S1P1IF_LENGTH                              0x1
#define _PWM2GIR_S1P1IF_MASK                                0x1
#define _PWM2GIR_S1P2IF_POSN                                0x1
#define _PWM2GIR_S1P2IF_POSITION                            0x1
#define _PWM2GIR_S1P2IF_SIZE                                0x1
#define _PWM2GIR_S1P2IF_LENGTH                              0x1
#define _PWM2GIR_S1P2IF_MASK                                0x2

// Register: PWM2GIE
#define PWM2GIE PWM2GIE
extern volatile unsigned char           PWM2GIE             __at(0x477);
#ifndef _LIB_BUILD
asm("PWM2GIE equ 0477h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1IE                 :1;
        unsigned S1P2IE                 :1;
    };
} PWM2GIEbits_t;
extern volatile PWM2GIEbits_t PWM2GIEbits __at(0x477);
// bitfield macros
#define _PWM2GIE_S1P1IE_POSN                                0x0
#define _PWM2GIE_S1P1IE_POSITION                            0x0
#define _PWM2GIE_S1P1IE_SIZE                                0x1
#define _PWM2GIE_S1P1IE_LENGTH                              0x1
#define _PWM2GIE_S1P1IE_MASK                                0x1
#define _PWM2GIE_S1P2IE_POSN                                0x1
#define _PWM2GIE_S1P2IE_POSITION                            0x1
#define _PWM2GIE_S1P2IE_SIZE                                0x1
#define _PWM2GIE_S1P2IE_LENGTH                              0x1
#define _PWM2GIE_S1P2IE_MASK                                0x2

// Register: PWM2CON
#define PWM2CON PWM2CON
extern volatile unsigned char           PWM2CON             __at(0x478);
#ifndef _LIB_BUILD
asm("PWM2CON equ 0478h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERSNOW                 :1;
        unsigned ERSPOL                 :1;
        unsigned LD                     :1;
        unsigned                        :4;
        unsigned EN                     :1;
    };
} PWM2CONbits_t;
extern volatile PWM2CONbits_t PWM2CONbits __at(0x478);
// bitfield macros
#define _PWM2CON_ERSNOW_POSN                                0x0
#define _PWM2CON_ERSNOW_POSITION                            0x0
#define _PWM2CON_ERSNOW_SIZE                                0x1
#define _PWM2CON_ERSNOW_LENGTH                              0x1
#define _PWM2CON_ERSNOW_MASK                                0x1
#define _PWM2CON_ERSPOL_POSN                                0x1
#define _PWM2CON_ERSPOL_POSITION                            0x1
#define _PWM2CON_ERSPOL_SIZE                                0x1
#define _PWM2CON_ERSPOL_LENGTH                              0x1
#define _PWM2CON_ERSPOL_MASK                                0x2
#define _PWM2CON_LD_POSN                                    0x2
#define _PWM2CON_LD_POSITION                                0x2
#define _PWM2CON_LD_SIZE                                    0x1
#define _PWM2CON_LD_LENGTH                                  0x1
#define _PWM2CON_LD_MASK                                    0x4
#define _PWM2CON_EN_POSN                                    0x7
#define _PWM2CON_EN_POSITION                                0x7
#define _PWM2CON_EN_SIZE                                    0x1
#define _PWM2CON_EN_LENGTH                                  0x1
#define _PWM2CON_EN_MASK                                    0x80

// Register: PWM2S1CFG
#define PWM2S1CFG PWM2S1CFG
extern volatile unsigned char           PWM2S1CFG           __at(0x479);
#ifndef _LIB_BUILD
asm("PWM2S1CFG equ 0479h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned PPEN                   :1;
        unsigned                        :2;
        unsigned POL1                   :1;
        unsigned POL2                   :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
} PWM2S1CFGbits_t;
extern volatile PWM2S1CFGbits_t PWM2S1CFGbits __at(0x479);
// bitfield macros
#define _PWM2S1CFG_MODE_POSN                                0x0
#define _PWM2S1CFG_MODE_POSITION                            0x0
#define _PWM2S1CFG_MODE_SIZE                                0x3
#define _PWM2S1CFG_MODE_LENGTH                              0x3
#define _PWM2S1CFG_MODE_MASK                                0x7
#define _PWM2S1CFG_PPEN_POSN                                0x3
#define _PWM2S1CFG_PPEN_POSITION                            0x3
#define _PWM2S1CFG_PPEN_SIZE                                0x1
#define _PWM2S1CFG_PPEN_LENGTH                              0x1
#define _PWM2S1CFG_PPEN_MASK                                0x8
#define _PWM2S1CFG_POL1_POSN                                0x6
#define _PWM2S1CFG_POL1_POSITION                            0x6
#define _PWM2S1CFG_POL1_SIZE                                0x1
#define _PWM2S1CFG_POL1_LENGTH                              0x1
#define _PWM2S1CFG_POL1_MASK                                0x40
#define _PWM2S1CFG_POL2_POSN                                0x7
#define _PWM2S1CFG_POL2_POSITION                            0x7
#define _PWM2S1CFG_POL2_SIZE                                0x1
#define _PWM2S1CFG_POL2_LENGTH                              0x1
#define _PWM2S1CFG_POL2_MASK                                0x80
#define _PWM2S1CFG_MODE0_POSN                               0x0
#define _PWM2S1CFG_MODE0_POSITION                           0x0
#define _PWM2S1CFG_MODE0_SIZE                               0x1
#define _PWM2S1CFG_MODE0_LENGTH                             0x1
#define _PWM2S1CFG_MODE0_MASK                               0x1
#define _PWM2S1CFG_MODE1_POSN                               0x1
#define _PWM2S1CFG_MODE1_POSITION                           0x1
#define _PWM2S1CFG_MODE1_SIZE                               0x1
#define _PWM2S1CFG_MODE1_LENGTH                             0x1
#define _PWM2S1CFG_MODE1_MASK                               0x2
#define _PWM2S1CFG_MODE2_POSN                               0x2
#define _PWM2S1CFG_MODE2_POSITION                           0x2
#define _PWM2S1CFG_MODE2_SIZE                               0x1
#define _PWM2S1CFG_MODE2_LENGTH                             0x1
#define _PWM2S1CFG_MODE2_MASK                               0x4

// Register: PWM2S1P1
#define PWM2S1P1 PWM2S1P1
extern volatile unsigned short          PWM2S1P1            __at(0x47A);
#ifndef _LIB_BUILD
asm("PWM2S1P1 equ 047Ah");
#endif

// Register: PWM2S1P1L
#define PWM2S1P1L PWM2S1P1L
extern volatile unsigned char           PWM2S1P1L           __at(0x47A);
#ifndef _LIB_BUILD
asm("PWM2S1P1L equ 047Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1L                  :8;
    };
} PWM2S1P1Lbits_t;
extern volatile PWM2S1P1Lbits_t PWM2S1P1Lbits __at(0x47A);
// bitfield macros
#define _PWM2S1P1L_S1P1L_POSN                               0x0
#define _PWM2S1P1L_S1P1L_POSITION                           0x0
#define _PWM2S1P1L_S1P1L_SIZE                               0x8
#define _PWM2S1P1L_S1P1L_LENGTH                             0x8
#define _PWM2S1P1L_S1P1L_MASK                               0xFF

// Register: PWM2S1P1H
#define PWM2S1P1H PWM2S1P1H
extern volatile unsigned char           PWM2S1P1H           __at(0x47B);
#ifndef _LIB_BUILD
asm("PWM2S1P1H equ 047Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1H                  :8;
    };
} PWM2S1P1Hbits_t;
